# @Time    : 2018/10/22 22:20
# @Author  : Yanlin Wang
# @Email   : wangyl_a@163.com
# @File    : format.py

"""
format 控制输出

^、<、>分别是居中、左对齐、右对齐，后面带宽度 >10
:号后面带填充的字符，只能是一个字符，不指定的话默认是用空格填充 :a
'{:.2f}'.format(321.33345)
进制了，b、d、o、x分别是二进制、十进制、八进制、十六进制 
'{:b}'.format(17)

用，号还能用来做金额的千位分隔符
'{:,}'.format(1234567890) # '1,234,567,890'
"""
print('{:.2f}'.format(321.33345))  # 321.33, 要启用其它控制符,这个: 必须有

print('{:>8}'.format('189'))  # 189

print('{:0>8}'.format('189'))  # 00000189

print('{:a>8}'.format('189'))  # aaaaa189


